rm(list = ls())
# 분석 환경 설정
getwd() # 현재 디렉토리 확인
setwd("C:/Users/user/Desktop/세분류/법무부허용작물/예측용데이터셋") # 데이터가 존재하는 디렉토리로 변경
options(scipen = 999, digits = 15) # 숫자 표시 형식 지정

# 패키지 로드
library(openxlsx)
library(dplyr)
library(data.table)
library(stringr)

# 현재 디렉토리에 존재하는 파일명을 출력합니다.
file_list <- list.files()
print(file_list)

# 데이터 불러오기
file = file_list[1]
data <- read.xlsx(file, sheet = 1, startRow = 3)  # 시트 번호 또는 이름을 설정할 수 있습니다.

# 중복 컬럼명(지차체명) 변경
colnames(data)[2:3] <- c("지자체명_시도", "지자체명_시군구")

# 데이터 전처리
### 표기 오류 정정
##### 담양 → 담양군
##### 충청북도 청양군 → 충청남도 청양군
##### 불필요한 공백 제거 (가장 앞 혹은 가장 뒤)
apply <- 
  data %>% 
  mutate(지자체명_시군구 = ifelse(지자체명_시군구 == '담양', '담양군', 지자체명_시군구),
         지자체명_시도 = ifelse(지자체명_시군구 == '청양군' & 지자체명_시도 == '충청북도', '충청남도', 지자체명_시도),
         지자체명_시도 = str_trim(지자체명_시도),
         지자체명_시군구 = str_trim(지자체명_시군구))

######################################################
########################################### 농업경영체
######################################################
# '-' 제거
apply <- apply %>% 
  mutate(농업경영체 = gsub('-', '', 농업경영체))
# 공백 및 특수문자 제거
apply <- apply %>% 
  mutate(농업경영체 = gsub('  ', '', 농업경영체))
apply <- apply %>% 
  mutate(농업경영체 = gsub(' ', '', 농업경영체))
apply <- apply %>% 
  mutate(농업경영체 = gsub('\\*', '', 농업경영체))
apply <- apply %>% 
  mutate(농업경영체 = gsub(' ', '', 농업경영체))
apply <- apply %>% 
  mutate(농업경영체 = gsub('\n', '', 농업경영체))

# 1. 농업경영체 등록번호 자리 수 계산
apply <- apply %>%
  mutate(자리수 = nchar(농업경영체))

apply %>%
  group_by(자리수) %>%
  summarize(데이터_개수 = n())

# 2. 자리수가 NA인 데이터 (공백)
apply %>% filter(nchar(농업경영체) == 0) # 2건
apply %>% filter(is.na(nchar(농업경영체))) # 10건

# 3. 자리수가 2인 데이터 (없음)
apply %>% filter(nchar(농업경영체) == 2) # 1건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 2)

# 4. 자리수가 3인 데이터 (공공형)
apply %>% filter(nchar(농업경영체) == 3) # 1건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 3)

# 5. 자리수가 4인 데이터 (해당없음 혹은 미정)
apply %>% filter(nchar(농업경영체) == 4) # 5건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 4)

# 6. 자리수가 8인 데이터 (검토 필요)
apply %>% filter(nchar(농업경영체) == 8) # 2건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 8)

# 7. 자리수가 9인 데이터
apply %>% filter(nchar(농업경영체) == 9)
### 7-1. 첫차리가 0인 경우, 가장 앞에 1을 부착
apply <- apply %>%
  mutate(농업경영체 = ifelse(nchar(농업경영체) == 9 & substr(농업경영체, 1, 1) == "0", 
                        paste0("1", 농업경영체), 농업경영체))
### 7-2. 검토필요
apply %>% filter(nchar(농업경영체) == 9) # 15건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 9)

# 8. 자리수가 11자리 이상인 데이터
apply %>% filter(nchar(농업경영체) >= 11) # 21건
# 8-1. 최초 10자리만 추출
apply <- apply %>% 
  mutate(농업경영체 = ifelse(nchar(농업경영체) >= 11, substr(농업경영체, 1, 10), 농업경영체))

# 8-2. 문자형인 경우 제거
apply$농업경영체 <- as.numeric(apply$농업경영체)
apply <- apply %>% 
  filter(!is.na(농업경영체))

# 9. 농업경영체 등록번호 자리 수 다시 계산
apply <- apply %>%
  mutate(자리수 = nchar(농업경영체))

apply %>%
  group_by(자리수) %>%
  summarize(데이터_개수 = n())

# 10. 자리수가 1인 데이터 (0)
apply %>% filter(nchar(농업경영체) == 1) # 1건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 1)

# 11. 자리수가 6인 데이터
apply %>% filter(nchar(농업경영체) == 6) # 1건
### 제거
apply <- apply %>% 
  filter(nchar(농업경영체) != 6)

# 최종 레코드 수 확인
nrow(apply)

apply <- apply %>% 
  select(-'자리수')
### 제거 
apply <- apply %>% 
  filter(nchar(농업경영체) != 0)

#####################################################################
########################################### 배정신청.인원 Column 정제
#####################################################################
# 0. 데이터 분포 확인
apply %>% 
  group_by(배정신청.인원) %>% 
  summarize(n = n())

# 1. 결측값 및 오류값 처리
apply <- 
  apply %>%
  mutate(배정신청.인원 = ifelse(is.na(배정신청.인원) | 배정신청.인원 == '-', 0, 배정신청.인원))

# 2. 데이터 타입 변환(숫자형)
apply$배정신청.인원 <- as.numeric(apply$배정신청.인원)

#####################################################################
###################################### 지자체추가배정인원 Column 정제
#####################################################################
# 0. 데이터 분포 확인
apply %>% 
  group_by(지자체추가배정인원) %>% 
  summarize(n = n())

# 1. 결측값 및 오류값 처리
apply <- 
  apply %>%
  mutate(지자체추가배정인원 = ifelse(is.na(지자체추가배정인원) | 지자체추가배정인원 == '-' | 지자체추가배정인원 == '없음', 0, 지자체추가배정인원))

# 2. 데이터 타입 변환(숫자형)
apply$지자체추가배정인원 <- as.numeric(apply$지자체추가배정인원)


#####################################################################
#################################################### 합계 Column 정제
#####################################################################
apply <- 
  apply %>% 
  mutate(합계 = 배정신청.인원 + 지자체추가배정인원)

# 2. 데이터 타입 변환(숫자형)
apply$합계 <- as.numeric(apply$합계)

#####################################################################
############################################### 작물.종류 Column 정제
#####################################################################
apply %>% 
  group_by(작물.종류) %>% 
  summarise(n = n())

apply <- 
  apply %>%
  mutate(
    작물.종류 = case_when(
      grepl('①|1', 작물.종류) ~ '① 시설원예·특작',
      grepl('②|2', 작물.종류) ~ '② 버섯',
      grepl('③|3', 작물.종류) ~ '③ 과수',
      grepl('④|4|인삼', 작물.종류) ~ '④ 인삼, 일반채소',
      grepl('⑤', 작물.종류) ~ '⑤ 종묘재배',
      grepl('⑥|기타원예·특작', 작물.종류) ~ '⑥ 기타원예·특작',
      grepl('⑦|곡물', 작물.종류) ~ '⑦ 곡물',
      grepl('⑧|기타식량작물', 작물.종류) ~ '⑧ 기타 식량작물',
      TRUE ~ 작물.종류
    )
  )


table(apply$작물.종류)


write.csv(apply, '신청현황_최종.csv', fileEncoding = "EUC-KR", row.names = F)
